app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "admin"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, pw)
    user = User.find_by_username(username)

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "admin"], ["LIMIT", 1]]
---
  def self.find_admin
    user = User.find_by_username("admin")